Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem.GetAirSystemData
Returns the air system data, null if not available.
Since:
2020

Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem.GetWaterLoopData
Returns the water loop data, null if not available.
Since:
2020

Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Mechanical.AnalyticalSystemDomain,System.String)
Creates a new analytical loop
document:
The document where the new element will be created.
domain:
The domain of analytical system to be created.
name:
The name of new analytical system. The actual name may be post-fixed if already exists.
Returns:
The newly created analytical loop.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters.
-or-
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2020

Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem.AnalyticalSystemDomain
The type of analytical system.
Since:
2020

Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem
Represents an analytical system where the air or water is circulated to satisfy building energy requirements.
Since:
2020